src/InformationRegisters/БИТС_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БИТС_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonForms/БИТС_Спринт/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиФормы();
	ЗаполнитьТаблицы();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

#Область КомандыОбщие

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВремяЗаСпринт(Команда)
	
	Стадии = БИТС_СкрамСервер.Стадии(URL_API, SPRINT_ID);
	ВремяЗаСпринт = ВремяЗаСпринтНаСервере();
	Для Каждого Стадия Из Стадии Цикл
		ИмяЭлемента = "Задачи" + Стадия.Значение["Наименование"];
		Для Каждого Строка Из ЭтаФорма[ИмяЭлемента] Цикл
			
			ЗатратыЗадачи = ВремяЗаСпринт[Строка["id"]];
			Если ЗатратыЗадачи = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Строка["timeSpentInLogs"] = Строка(ЗатратыЗадачи["Всего"]);
			Строка["ВремяЗаСпринт"] = Строка(ЗатратыЗадачи["ЗаСпринт"]); 
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРезультаты(Команда)
	
	Стадии = БИТС_СкрамСервер.Стадии(URL_API, SPRINT_ID);
	РезультатыЗадач = ПолучитьРезультатыНаСервере();
	Для Каждого Стадия Из Стадии Цикл
		ИмяЭлемента = "Задачи" + Стадия.Значение["Наименование"];
		Для Каждого Строка Из ЭтаФорма[ИмяЭлемента] Цикл
			
			РезультатыЗадачи = РезультатыЗадач[Строка["id"]];
			Если РезультатыЗадачи = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// TODO: Добавить результаты
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Дайджест(Команда)
	Дайджест = ДайджестНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("РегистрСведений.БИТС_Настройки.ФормаСписка",,,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

#КонецОбласти

#Область КомандыТаблиц

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	
	ИмяТаблицы = СтрЗаменить(ЭтаФорма.ТекущийЭлемент.Имя, "ВыделитьВсе", "");
	Для Каждого Строка Из ЭтаФорма[ИмяТаблицы] Цикл
		Строка.Выбран = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	ИмяТаблицы = СтрЗаменить(ЭтаФорма.ТекущийЭлемент.Имя, "СнятьВсе", "");
	Для Каждого Строка Из ЭтаФорма[ИмяТаблицы] Цикл
		Строка.Выбран = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкиФормы()
	
	Скрам = БИТС_СкрамСервер.Настройки();
	Спринт = БИТС_СкрамСервер.Спринты(Скрам["URL_API"], Скрам["GROUP_ID"], Истина);
	
	Для Каждого Настройка Из Скрам Цикл
		ЭтаФорма[Настройка.Ключ] = Настройка.Значение;
	КонецЦикла;
	
	Для Каждого Настройка Из Спринт Цикл
		ЭтаФорма[Настройка.Ключ] = Настройка.Значение;
	КонецЦикла;
	 
	ЭтаФорма.Заголовок = БИТС_СлужебныйСервер.ПредставлениеСпринта(Спринт);
	
КонецПроцедуры

#Область РаботаСТаблицами

&НаСервере
Процедура ОбновитьНаСервере()
	
	НастройкиФормы();
	СтадииСпринта = БИТС_СкрамСервер.Стадии(URL_API, SPRINT_ID, Истина);
	ЗадачиСпринта = БИТС_ЗадачиСервер.Получить(URL_API, GROUP_ID, SPRINT_ID, Истина);
	ЗаполнитьТаблицы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицы()
	
	ОчиститьТаблицы();
	
	СтадииСпринта = БИТС_СкрамСервер.Стадии(URL_API, SPRINT_ID);
	ЗадачиСпринта = БИТС_ЗадачиСервер.Получить(URL_API, GROUP_ID, SPRINT_ID);

	Для Каждого Задача Из ЗадачиСпринта Цикл
		ИмяЭлемента = "Задачи" + СтадииСпринта[Задача["stageId"]]["Наименование"];
		СтрокаСтадии = ЭтаФорма[ИмяЭлемента].Добавить();
		Для Каждого Поле Из Задача Цикл
			
			СтрокаСтадии[Поле.Ключ] = Расшифровка(Поле);
			СтрокаСтадии["НадписьТаблицыВремя"] = "Время в часах";
			СтрокаСтадии["НадписьТаблицыВсего"] = "Всего:";
			СтрокаСтадии["НадписьТаблицыЗаСпринт"] = "Спринт:";
			СтрокаСтадии["НадписьТаблицыОценка"] = "Оценка:";
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТаблицы()
	
	Стадии = БИТС_СкрамСервер.Стадии(URL_API, SPRINT_ID);
	ЭтаФорма.TASKS.Очистить();
	Для Каждого Стадия Из Стадии Цикл
		ИмяЭлемента = "Задачи" + Стадия.Значение["Наименование"]; 
		ЭтаФорма[ИмяЭлемента].Очистить();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСЗадачами

&НаСервере
Функция ДайджестНаСервере()
	
	Результат = "";
	
	ВыбранныеЗадачи = ВыбранныеЗадачи(); 
	Если ВыбранныеЗадачи.Количество() = 0 Тогда
		Сообщить("Задачи не выбраны");
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьРезультатыНаСервере()
	
	Результат = Новый Соответствие;
	
	ВыбранныеЗадачи = ВыбранныеЗадачи(); 
	Если ВыбранныеЗадачи.Количество() = 0 Тогда
		Сообщить("Задачи не выбраны");
		Возврат Результат;
	КонецЕсли; 
	
	Результат = БИТС_РезультатыСервер.ПолучитьДляЗадач(URL_API, ВыбранныеЗадачи);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВремяЗаСпринтНаСервере()
	
	Результат = Новый Соответствие;
	
	ВыбранныеЗадачи = ВыбранныеЗадачи(); 
	Если ВыбранныеЗадачи.Количество() = 0 Тогда
		Сообщить("Задачи не выбраны");
		Возврат Результат;
	КонецЕсли;
	
	Результат = БИТС_ЗадачиСервер.ВремяЗаСпринт(URL_API, ВыбранныеЗадачи, SPRINT_START, SPRINT_END);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВыбранныеЗадачи()
	
	Результат = Новый Массив;
	
	Стадии = БИТС_СкрамСервер.Стадии(URL_API, SPRINT_ID);
	Для Каждого Стадия Из Стадии Цикл
		ИмяЭлемента = "Задачи" + Стадия.Значение["Наименование"];
		Для Каждого Задача Из ЭтаФорма[ИмяЭлемента] Цикл
			Если Задача.Выбран Тогда
				Результат.Добавить(Задача.id);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Расшифровка(Поле)
	
	Результат = "";
	
	Если Поле.Ключ = "timeSpentInLogs" ИЛИ Поле.Ключ = "timeEstimate" Тогда
		Если ЗначениеЗаполнено(Поле.Значение) Тогда
			Результат = Строка(БИТС_СлужебныйСервер.СекундыВЧасы(Поле.Значение));
		Иначе
			Результат = "0";
		КонецЕсли;
	ИначеЕсли Поле.Ключ = "description" Тогда
		РегулярноеВыражение = "\[(/?[^\]]+)\]";
		Результат = СтрЗаменитьПоРегулярномуВыражению(Поле.Значение, РегулярноеВыражение, "");
	Иначе
		Результат = Поле.Значение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВидимостьСтадии(Команда) 
	
	Если ЭтаФорма.ТекущийЭлемент.ЦветФона = WebЦвета.СветлоКоралловый Тогда
		ЭтаФорма.ТекущийЭлемент.ЦветФона = WebЦвета.НейтральноАквамариновый;
	Иначе
		ЭтаФорма.ТекущийЭлемент.ЦветФона = WebЦвета.СветлоКоралловый
	КонецЕсли;
	
	ИмяГруппы = СтрЗаменить(ЭтаФорма.ТекущийЭлемент.Имя, "ВидимостьСтадии", "ГруппаСтадия");
	Элементы[ИмяГруппы].Видимость = НЕ Элементы[ИмяГруппы].Видимость; 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
